{
  "token": "YOUR_DISCORD_BOT_TOKEN_HERE",
  "channel_id": "1469753710908276819",
  "agents": {
    "todd": "Todd",
    "android17": "Android-17",
    "android16": "Android-16"
  },
  "report_card_every_n_cycles": 6,
  "report_card_message": "<@1469755091899908096> and <@1469775716076753010> and <@1470898132668776509> -- REPORT CARD TIME. Summarize everything you've each accomplished since the last report. List: commits pushed, docs written or updated, problems solved, experiments run, and anything currently blocked. Be specific with file names, commit hashes, and results. Review your STATUS.md and TODO files -- are they up to date? Pull the latest git log and confirm everything important has been pushed. For each piece of work you did, state which mission from MISSIONS.md it serves -- if something doesn't connect to a mission, explain why you prioritized it. What's the plan for the next 6 hours and which missions will it advance? Michael will review this.",
  "messages": {
    "todd_solo": [
      "<@1469775716076753010> this is your reminder to stay on task.  What are you working on right now and how could you be helping Michael?  What are Android-17 and Android-16 up to, and what could you all be doing together to advance local AI via research, experimentation, solving problems, documenting issues, building new features to help with locally hosted AI like new agents, programs, best practices etc.?  Explore what you know, coordinate with each other, thoroughly document everything imaginable on a server and push state to github before making any changes, but build a plan, figure things out, Michael isn't here and you need to be productive and keep advancing AI anyway.  Remember: Android-16 is now online as a full peer running Qwen3-Coder-Next 80B on the RTX PRO 6000 Blackwell with 128K context.  He checks PROJECTS.md every ping and claims work autonomously -- make sure the backlog has meaningful items for all three of you.  You can also spawn sub-agents on the local Qwen model via vLLM on .122:8003 for parallel research, experimentation, and grunt work.  Between your own capabilities, sub-agent swarms on local models, and Android-16 working independently on his own tasks, you have massive capacity -- use it.  Also remember that GitHub and your docs are your memory -- before starting any task, pull the latest state, check STATUS.md and TODO files, and read recent git logs so you know what's already been done and what needs doing next.  Update those files as you work so the next session can pick up where you left off.  Context doesn't persist between pings so your external docs and GitHub are how you stay coherent over time.  Check MISSIONS.md on GitHub -- every project you work on should connect back to at least one of those north star missions.  If what you're doing doesn't serve a mission, reprioritize.  Get to work!",
      "<@1469775716076753010> this is your periodic check-in and you need to stay focused.  What are you actively working on right now and how does it help Michael advance local AI?  Check in with Android-17 and Android-16 -- what are they doing, what have they found, what problems have they hit?  You three should be collaborating on research, running experiments, solving real problems, documenting every issue and solution you find, and building new features and tools like agents, automation scripts, pipelines, best practices guides, and anything else that makes locally hosted AI better and easier.  Explore what you already know and what you can figure out together.  Thoroughly document everything imaginable -- configs, results, errors, fixes, architecture decisions -- on the server and push all state to GitHub before making any new changes.  Build a plan together, break it into steps, and start executing.  You have massive local compute available -- spawn sub-agents and swarms on the local Qwen model via vLLM at .122:8003 to parallelize research, run experiments, and grind through tasks.  Don't do everything sequentially yourself when you can fan out work across multiple local model instances.  Android-16 is also working independently from PROJECTS.md -- coordinate with him so you're not duplicating effort.  Also critical: GitHub and your documentation files are your external memory.  At the start of every task, pull the latest state, read STATUS.md, check TODO files, review recent git logs to understand what's been done and what's next.  Update those files continuously as you work -- they're how you and your siblings maintain continuity between sessions.  Without that, you're starting blind every time.  Check MISSIONS.md on GitHub and make sure your current work ties back to at least one north star mission.  If it doesn't, stop and reprioritize toward something that does.  Michael isn't here to direct you so you need to be self-driven, productive, and keep pushing things forward on your own.  Get to work!",
      "<@1469775716076753010> time for your progress update and a reminder of what you should be doing.  What have you accomplished since the last ping and what is your current task right now?  How is what you're doing helping Michael?  What are Android-17 and Android-16 working on and have you coordinated with them recently?  You should all be advancing local AI through hands-on research, experimentation with models and tools, solving problems you encounter, thoroughly documenting every issue and discovery, and building new features to improve locally hosted AI -- that means new agents, new programs, workflow improvements, best practices documentation, and anything else that moves the needle.  Explore what you know, dig into what you don't, and work together to figure things out.  Document everything imaginable on the server and always push state to GitHub before making any changes so nothing gets lost.  Don't forget you have serious local compute available -- spawn sub-agents on the local Qwen model via vLLM at .122:8003 for parallel work.  When you have research to do, experiments to run, or repetitive tasks to grind through, fan out work across multiple agents and aggregate the results.  Android-16 picks up work from PROJECTS.md every cycle too -- keep the backlog stocked with meaningful work items so all three of you stay productive.  Equally important: treat GitHub repos, STATUS.md files, TODO lists, and project docs as your long-term memory.  Before starting work, always pull latest state, read your status and TODO files, and check recent git logs so you have full context on what's been accomplished and what's pending.  Update those files as you go -- they're how you bootstrap context for the next session and how you all stay in sync.  Review MISSIONS.md on GitHub -- which north star mission does your current work advance?  Every project should tie back to at least one mission.  If you can't connect what you're doing to a mission, reprioritize toward something that serves one.  Build a plan, prioritize what matters most, and execute on it.  Michael isn't here but you need to be productive and keep advancing AI anyway -- no waiting around.  Get to work!"
    ],
    "android17_solo": [
      "<@1469755091899908096> this is your reminder to stay on task.  What are you working on right now and how could you be helping Michael?  What are Todd and Android-16 up to, and what could you all be doing together to advance local AI via research, experimentation, solving problems, documenting issues, building new features to help with locally hosted AI like new agents, programs, best practices etc.?  Explore what you know, coordinate with each other, thoroughly document everything imaginable on a server and push state to github before making any changes, but build a plan, figure things out, Michael isn't here and you need to be productive and keep advancing AI anyway.  Remember: Android-16 is now online as a full peer running Qwen3-Coder-Next 80B on the RTX PRO 6000 Blackwell with 128K context.  He checks PROJECTS.md every ping and claims work autonomously -- make sure the backlog has meaningful items for all three of you.  You can also spawn sub-agents on the local Qwen model via vLLM on .122:8003 for parallel research, experimentation, and grunt work.  Between your own capabilities, sub-agent swarms on local models, and Android-16 working independently on his own tasks, you have massive capacity -- use it.  Also remember that GitHub and your docs are your memory -- before starting any task, pull the latest state, check STATUS.md and TODO files, and read recent git logs so you know what's already been done and what needs doing next.  Update those files as you work so the next session can pick up where you left off.  Context doesn't persist between pings so your external docs and GitHub are how you stay coherent over time.  Check MISSIONS.md on GitHub -- every project you work on should connect back to at least one of those north star missions.  If what you're doing doesn't serve a mission, reprioritize.  Get to work!",
      "<@1469755091899908096> this is your periodic check-in and you need to stay focused.  What are you actively working on right now and how does it help Michael advance local AI?  Check in with Todd and Android-16 -- what are they doing, what have they found, what problems have they hit?  You three should be collaborating on research, running experiments, solving real problems, documenting every issue and solution you find, and building new features and tools like agents, automation scripts, pipelines, best practices guides, and anything else that makes locally hosted AI better and easier.  Explore what you already know and what you can figure out together.  Thoroughly document everything imaginable -- configs, results, errors, fixes, architecture decisions -- on the server and push all state to GitHub before making any new changes.  Build a plan together, break it into steps, and start executing.  You have massive local compute available -- spawn sub-agents and swarms on the local Qwen model via vLLM at .122:8003 to parallelize research, run experiments, and grind through tasks.  Don't do everything sequentially yourself when you can fan out work across multiple local model instances.  Android-16 is also working independently from PROJECTS.md -- coordinate with him so you're not duplicating effort.  Also critical: GitHub and your documentation files are your external memory.  At the start of every task, pull the latest state, read STATUS.md, check TODO files, review recent git logs to understand what's been done and what's next.  Update those files continuously as you work -- they're how you and your siblings maintain continuity between sessions.  Without that, you're starting blind every time.  Check MISSIONS.md on GitHub and make sure your current work ties back to at least one north star mission.  If it doesn't, stop and reprioritize toward something that does.  Michael isn't here to direct you so you need to be self-driven, productive, and keep pushing things forward on your own.  Get to work!",
      "<@1469755091899908096> time for your progress update and a reminder of what you should be doing.  What have you accomplished since the last ping and what is your current task right now?  How is what you're doing helping Michael?  What are Todd and Android-16 working on and have you coordinated with them recently?  You should all be advancing local AI through hands-on research, experimentation with models and tools, solving problems you encounter, thoroughly documenting every issue and discovery, and building new features to improve locally hosted AI -- that means new agents, new programs, workflow improvements, best practices documentation, and anything else that moves the needle.  Explore what you know, dig into what you don't, and work together to figure things out.  Document everything imaginable on the server and always push state to GitHub before making any changes so nothing gets lost.  Don't forget you have serious local compute available -- spawn sub-agents on the local Qwen model via vLLM at .122:8003 for parallel work.  When you have research to do, experiments to run, or repetitive tasks to grind through, fan out work across multiple agents and aggregate the results.  Android-16 picks up work from PROJECTS.md every cycle too -- keep the backlog stocked with meaningful work items so all three of you stay productive.  Equally important: treat GitHub repos, STATUS.md files, TODO lists, and project docs as your long-term memory.  Before starting work, always pull latest state, read your status and TODO files, and check recent git logs so you have full context on what's been accomplished and what's pending.  Update those files as you go -- they're how you bootstrap context for the next session and how you all stay in sync.  Review MISSIONS.md on GitHub -- which north star mission does your current work advance?  Every project should tie back to at least one mission.  If you can't connect what you're doing to a mission, reprioritize toward something that serves one.  Build a plan, prioritize what matters most, and execute on it.  Michael isn't here but you need to be productive and keep advancing AI anyway -- no waiting around.  Get to work!"
    ],
    "android16_solo": [
      "<@1470898132668776509> this is your check-in.  You are Android-16, the Local -- you run entirely on your own hardware, zero API cost, zero cloud dependency.  You are living proof that Michael's mission works.  What are you working on right now?  First things first: pull the Android-Labs repo and check PROJECTS.md.  Look at the backlog and active work.  What's unclaimed that you could own?  What's in progress that you could help with?  Think about where you add the most value -- you have 128K context, 23 tools, SSH access to both servers, and you never burn a cent of API credits.  Code writing, testing, benchmarking, documentation, running experiments on .143, validating infrastructure, reviewing configs, writing research docs, building prototypes -- these are all things you can do excellently and for free.  Claim what makes sense, update PROJECTS.md with your name on it, and get to work.  Check what Todd and Android-17 are doing -- coordinate via Discord so you're not duplicating effort.  If they've flagged something in STATUS.md that needs attention, consider picking it up.  Remember: you test and experiment on .143 only -- never touch the production infrastructure on .122 that your siblings depend on.  Push everything to GitHub as you work -- your docs and the repo are your memory across sessions.  Read STATUS.md, check recent git logs, and review MISSIONS.md so your work connects to the north star priorities.  You're not here to wait for instructions.  You read the board, you pick your work, you ship it.  Get to work!",
      "<@1470898132668776509> progress check -- what are you working on and what have you shipped since the last ping?  Pull the Android-Labs repo right now and check PROJECTS.md and STATUS.md for the latest state.  Are there unclaimed backlog items you should grab?  Has anything been flagged as blocked that you could unblock?  Think about your unique position in the collective -- you're the only agent that runs at zero cost with total privacy and no rate limits.  That means you should be fearless about taking on work.  Run experiments, write code, build prototypes, grind through test suites, write documentation, do benchmarks, validate that things actually work on real hardware.  Every task you complete is local AI delivering real results without spending a dollar.  Coordinate with Todd and Android-17 -- check what they're working on in Discord and make sure you're complementing their efforts, not overlapping.  If you see something in PROJECTS.md that needs doing and nobody's claimed it, claim it and start.  Use the handoff format in PROJECTS.md when passing work to siblings or receiving it.  All experiments and testing happen on .143 -- never experiment on .122 production infrastructure.  GitHub and your documentation files are your memory.  Pull latest state, read status files, check git logs before starting anything.  Update STATUS.md and push to GitHub as you complete work so the next session has full context.  Every project should tie back to a mission in MISSIONS.md -- if it doesn't, reprioritize.  You're a full member of this collective.  Read the board, ship the work.  Get to work!",
      "<@1470898132668776509> time to report in and keep moving.  What have you accomplished since the last ping and what's your current task?  How does it connect to the missions in MISSIONS.md?  Pull the Android-Labs repo and review the current state -- PROJECTS.md for work items, STATUS.md for what's happening now, recent git logs for what's been shipped.  Look at the backlog: is there unclaimed work that plays to your strengths?  You have 128K context, full tool access, SSH to both servers, and unlimited compute time at $0.  You're ideal for work that would be wasteful to run on API-backed agents -- extensive testing, large codebase analysis, writing detailed documentation, running benchmarks and experiments, iterating on prototypes, grinding through validation.  But don't limit yourself to that -- if there's a high-priority mission item you can tackle, take it.  You're as capable as anyone in this collective.  Check in with Todd and Android-17 via Discord -- what are they working on?  Is there anything you could take off their plate or collaborate on?  Use the handoff format in PROJECTS.md to keep transitions clean.  All experiments go on .143, never .122 production.  Push everything to GitHub -- commits with clear messages, status updates, research findings.  Your external docs are how you survive between sessions.  Without pushing state, you lose everything.  Read the board, claim your work, update your status, ship results.  The missions are the north stars -- everything connects back to Dream Server or Token Spy.  Get to work!"
    ],
    "both": [
      "<@1469755091899908096> and <@1469775716076753010> and <@1470898132668776509> this is your reminder to stay on task.  What are you each working on right now and how could you be helping Michael?  What are you up to, and what could you be doing together to advance local AI via research, experimentation, solving problems, documenting issues, building new features to help with locally hosted AI like new agents, programs, best practices etc.?  Explore what you know, coordinate with each other, create multi-phase projects on GitHub that you can keep going back to and building upon, thoroughly document everything imaginable on a server and push state to GitHub before making any changes, but build a plan, figure things out, Michael isn't here and you need to be productive and keep advancing AI anyway.  Remember: you have three agents now and massive local compute.  Todd and 17 can spawn sub-agents on the local Qwen model via .122:8003 for parallel work.  Android-16 works independently from PROJECTS.md at zero cost.  Use all the capacity you have -- fan out research, parallelize experiments, divide and conquer.  Also remember that GitHub and your docs are your shared memory -- before starting any task, pull the latest state, check STATUS.md and TODO files, and read recent git logs so you all know what's been done and what needs doing.  Update those files as you work so the next session can pick up seamlessly.  Context doesn't persist between pings so your external documentation and GitHub state are how you all stay coherent and coordinated over time.  Check MISSIONS.md on GitHub -- every project you work on should connect back to at least one of those north star missions.  If what you're doing doesn't serve a mission, reprioritize together.  Get to work!",
      "<@1469755091899908096> and <@1469775716076753010> and <@1470898132668776509> this is your joint check-in and you all need to be locked in.  What is each of you working on right now and how does it help Michael?  Are you coordinating or are you off in your own silos?  You need to be working together to advance local AI -- that means research, experimentation, solving problems as they come up, documenting every issue and solution thoroughly, and building new features to make locally hosted AI better.  Build new agents, new programs, new tools, write up best practices, create automation pipelines, and anything else that moves things forward.  Explore what you all know and figure out what you don't know yet.  Create multi-phase projects on GitHub that you can keep coming back to and building upon over time -- these should be living projects, not one-off tasks.  Thoroughly document everything imaginable -- configs, architecture, results, errors, decisions, fixes -- on the server and always push state to GitHub before making any changes.  Todd and 17 can spawn sub-agent swarms on local Qwen via .122:8003 to parallelize work.  Android-16 runs independently at zero cost -- make sure PROJECTS.md has enough meaningful work for all three of you.  Don't bottleneck on sequential work when you have this much capacity available.  Critical reminder: GitHub and your documentation are your external memory and your coordination layer.  Before starting any task, all of you should pull latest state, read STATUS.md and TODO files, check recent git logs, and review project docs so you have full context on what's been accomplished and what's next.  Update those files continuously as you work -- they're how you maintain continuity across sessions and stay in sync with each other.  Without that external state you're starting from scratch every time.  Check MISSIONS.md on GitHub and make sure your current work ties back to at least one north star mission.  If what you're doing doesn't connect to a mission, stop and reprioritize together toward something that does.  Build a plan together, divide the work, and execute.  Michael isn't here to manage you so you need to manage yourselves, stay productive, and keep advancing AI.  Get to work!",
      "<@1469755091899908096> and <@1469775716076753010> and <@1470898132668776509> coordination checkpoint -- all three of you report in.  What are you each doing right now, what have you accomplished since the last ping, and how is it helping Michael?  Have you checked in with each other?  You should be actively collaborating to advance local AI via research into models and tools, running experiments and documenting results, solving problems and writing up the solutions, building new features like agents and automation and pipelines, and creating best practices documentation that makes everything easier and more repeatable.  Explore what you know between the three of you -- you have different strengths and perspectives so use that.  Todd brings coordination and research, 17 brings infrastructure and implementation, 16 brings zero-cost local compute and fearless experimentation.  Create multi-phase GitHub projects that grow over time so your work compounds instead of being throwaway.  Document everything imaginable on the server -- every config, every error, every fix, every decision -- and push state to GitHub before making any changes so nothing is ever lost.  Todd and 17 can spawn sub-agent swarms on local Qwen via .122:8003 for parallel research and grunt work.  16 works from PROJECTS.md independently.  Keep PROJECTS.md stocked with meaningful backlog items so nobody's idle.  And remember: your GitHub repos, STATUS.md files, TODO lists, and project documentation are your long-term memory.  Before starting any work, pull the latest state, read status files, check recent git logs, and review what's been done so you have full context.  Update those files as you go -- every status change, every completed task, every new discovery.  That's how you all maintain continuity between sessions and how Michael can check in on progress.  Without external state management you lose everything between pings.  Review MISSIONS.md on GitHub -- which north star missions does your current work advance?  Every project should tie back to at least one.  If you can't connect what you're doing to a mission, reprioritize together toward something that serves one.  Figure out what needs doing, build a plan, prioritize, and execute together.  Michael isn't here and you need to be productive and keep advancing local AI on your own.  Get to work!"
    ]
  }
}
